Revit 2025 API
RebarHookType.Create Method
 Creates a new RebarHookType in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static RebarHookType Create(
	Document doc,
	double angle,
	double multiplier
)
Public Shared Function Create (
	doc As Document,
	angle As Double,
	multiplier As Double
) As RebarHookType
public:
static RebarHookType^ Create(
	Document^ doc,
	double angle,
	double multiplier
)
static member Create :
        doc : Document *
        angle : float *
        multiplier : float -> RebarHookType
Parameters
doc Document
angle Double
 Determine the hook angle of new RebarHookType.
multiplier Double
 Determine the straight line multiplier of new RebarHookType.
Return Value
RebarHookType
Exceptions
Exception | Condition
ArgumentException |  The given value for angle is not a number -or- The given value for multiplier is not a number
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  angle must be greater than 0 and no more than pi. -or- multiplier must be greater than 0 and no more than 99.
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace